# ContinuousRailTransitionFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ContinuousRailTransitionFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot create specified transition at rail path turn, hand Rail/Top Rail cannot maintain continuous.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContinuousRailTransitionFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousRailTransitionFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContinuousRailTransitionFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace